       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTCBL.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-INPUT-STRING.
          05 WS-STRING-LENGTH PIC 9(02) VALUE 0.
          05 WS-STRING-DATA   PIC X(50) VALUE "KAYAK".
       01 WS-REVERSE-STRING.
          05 WS-REVERSE-LENGTH PIC 9(02) VALUE 0.
          05 WS-REVERSE-DATA   PIC X(50) VALUE SPACES.
       01 WS-COUNTERS.
          05 WS-I             PIC 9(02) VALUE 0.
          05 WS-J             PIC 9(02) VALUE 0.
       01 WS-FLAGS.
           05 WS-IS-PALINDROME PIC X VALUE 'Y'.
               88 PALINDROME  VALUE 'Y'.
               88 NOT-PALINDROME VALUE 'N'.
       01 WS-DISPLAY-MESSAGE PIC X(25) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.

           PERFORM CALCULATE-STRING-LENGTH.
           PERFORM REVERSE-STRING.
           PERFORM CHECK-PALINDROME.
           PERFORM DISPLAY-RESULT.
           GOBACK.

       CALCULATE-STRING-LENGTH.
           INSPECT WS-STRING-DATA TALLYING WS-STRING-LENGTH 
             FOR CHARACTERS BEFORE INITIAL SPACE.

       REVERSE-STRING.
           MOVE WS-STRING-LENGTH TO WS-REVERSE-LENGTH.
           MOVE 0 TO WS-I.
           PERFORM VARYING WS-I FROM 1 BY 1 
             UNTIL WS-I > WS-STRING-LENGTH
               SUBTRACT WS-I FROM WS-STRING-LENGTH GIVING WS-J
               ADD 1 TO WS-J
               MOVE WS-STRING-DATA(WS-J:1) TO WS-REVERSE-DATA(WS-I:1)
           END-PERFORM.

       CHECK-PALINDROME.
           MOVE 0 TO WS-I.
           PERFORM VARYING WS-I FROM 1 BY 1
             UNTIL WS-I > WS-STRING-LENGTH
               OR NOT PALINDROME
               IF WS-STRING-DATA(WS-I:1) NOT = WS-REVERSE-DATA(WS-I:1)
                   SET NOT-PALINDROME TO TRUE
               END-IF
           END-PERFORM.

       DISPLAY-RESULT.
           IF PALINDROME
               MOVE "It is a Palindrome." TO WS-DISPLAY-MESSAGE
           ELSE
               MOVE "It is not a Palindrome." TO WS-DISPLAY-MESSAGE
           END-IF.
           DISPLAY "Final Result:" WS-DISPLAY-MESSAGE.

       END PROGRAM TESTCBL.
