//TESTJOB JOB 'TESTJOB',CLASS=U,MSGCLASS=X,TIME=1440,
//        COND=(8,LT),NOTIFY=MYUSERID,RESTART=*,LINES=(500,CANCEL)
//*
//*
//*
//*
//*
//RUNJOB EXEC PGM=TESTCBL
//SYSOUT DD SYSOUT=*
//*
